In [1]:
import pandas as pd
import numpy as np
import datetime

## Data Cleaning and Merging

## First Dataset

In [2]:
data1 = pd.read_csv('Dataset_A_Customer_Profiles_Messy.csv')
data1.head()

,Customer_ID,Full_Name,Age,Gender,Email_Address,Phone_Number,Account_Type,Account_Open_Date,Credit_Score,Income_Level
0,CUST23670,Kelly Porter,NaN,NaN,victorlindsey@hotmail.com,673.251.6093,Checking,2025-06-16,NaN,€145194
1,CUST23390,Christopher Ross,NaN,Non-Binary,margaret28@carr.com,8060575725,Savings,2025-06-09,NaN,£147861
2,CUST11019,Candace Suarez,NaN,NaN,robersonmeghan@hotmail.com,001-847-214-9089,Personal,2025-06-24,757.38,$116545
3,CUST23960,Sarah Smith,59.0,Female,ybradley@yahoo.com,2738768714,Business,2025-06-19,372.20,$78377
4,CUST12396,Mr. Jonathan Woodard Jr.,NaN,Male,ebishop@morales.com,(215)221-7890,Savings,2025-06-12,309.69,€119083

In [4]:
## columns, whitespaces, null/na, check each column data, check and remove duplicates where necessary, check for special characters, check for inconsistencies

In [5]:
data1.columns

Index(['Customer_ID ', 'Full_Name ', 'Age ', 'Gender ', 'Email_Address ',
       'Phone_Number ', 'Account_Type ', 'Account_Open_Date ', 'Credit_Score ',
       'Income_Level '],
      dtype='object')

In [6]:
def del_ytspaces():
    data1.columns = data1.columns.str.strip()

del_ytspaces()

print(data1.columns.tolist())

['Customer_ID', 'Full_Name', 'Age', 'Gender', 'Email_Address', 'Phone_Number', 'Account_Type', 'Account_Open_Date', 'Credit_Score', 'Income_Level']

In [7]:
data1.columns

Index(['Customer_ID', 'Full_Name', 'Age', 'Gender', 'Email_Address',
       'Phone_Number', 'Account_Type', 'Account_Open_Date', 'Credit_Score',
       'Income_Level'],
      dtype='object')

In [8]:
data1.iloc[15, 6]

'Savings '

In [9]:
def remove_ytspaces(df, column):
    df[column] = df[column].str.strip()
    return df

remove_ytspaces(data1, 'Customer_ID')
remove_ytspaces(data1, 'Full_Name')
remove_ytspaces(data1, 'Gender')
remove_ytspaces(data1, 'Email_Address')
remove_ytspaces(data1, 'Phone_Number')
remove_ytspaces(data1, 'Account_Type')
remove_ytspaces(data1, 'Account_Open_Date')
remove_ytspaces(data1, 'Income_Level')
print('white spaces removed')

white spaces removed

In [10]:
data1.iloc[15, 6]

'Savings'

In [11]:
data1['Customer_ID'].duplicated().sum()
#data1['Email_Address'].duplicated().sum()

300

In [12]:
data1[data1['Customer_ID'].duplicated(keep=False)].head()

,Customer_ID,Full_Name,Age,Gender,Email_Address,Phone_Number,Account_Type,Account_Open_Date,Credit_Score,Income_Level
35,CUST15492,Kelly Lopez,50.0,NaN,mwalker@yahoo.com,001-863-243-2542,NaN,2025-06-09,510.74,NaN
77,CUST17141,Richard Lopez,NaN,NaN,johnsonjulie@yahoo.com,9087929277,Checking,2025-06-09,599.69,$93351
99,CUST23851,John Campos,NaN,Female,brian24@barnett.info,982.591.1330,Savings,2025-06-27,NaN,£138476
108,CUST24201,Brian Clements,59.0,Male,henrypowers@walker-strong.com,085.794.7224x5978,NaN,2025-06-13,NaN,NaN
138,CUST22589,Tracy Williams,NaN,Female,lewiscarrie@johnson-kim.com,(437)758-9612,Personal,2025-06-24,705.27,$138885

In [13]:
data1[data1['Customer_ID'] == 'CUST15492']

,Customer_ID,Full_Name,Age,Gender,Email_Address,Phone_Number,Account_Type,Account_Open_Date,Credit_Score,Income_Level
35,CUST15492,Kelly Lopez,50.0,NaN,mwalker@yahoo.com,001-863-243-2542,NaN,2025-06-09,510.74,NaN
6419,CUST15492,Kelly Lopez,50.0,NaN,mwalker@yahoo.com,001-863-243-2542,NaN,2025-06-09,510.74,NaN

In [14]:
## customer ID has duplicate across rows but email does not

In [15]:
data1 = data1.drop_duplicates(subset='Customer_ID', keep='first')

In [16]:
data1['Customer_ID'].duplicated().sum()

0

In [17]:
data1[data1['Email_Address'].duplicated(keep=False)].sample(4)

,Customer_ID,Full_Name,Age,Gender,Email_Address,Phone_Number,Account_Type,Account_Open_Date,Credit_Score,Income_Level
9545,CUST26122,Michael Scott,26.0,Non-Binary,wilsonmegan@gmail.com,131-532-2737x6426,Business,2025-06-09,722.86,£93746
8511,CUST17316,Christina Kim,NaN,Female,gwest@yahoo.com,001-497-636-1752x5123,NaN,2025-06-24,NaN,€42997
9188,CUST21981,Amy Franco,51.0,Female,ashleyhall@gmail.com,+1-891-238-5386x799,Savings,2025-06-25,NaN,£40013
9968,CUST10474,Jeffrey Roberts,NaN,NaN,NaN,001-899-613-2385x40963,Personal,2025-06-29,NaN,$49789

In [18]:
data1[data1['Email_Address'] == 'tanderson@hotmail.com']
## Different customers have similar email address. could be a mistake when details were being entered

,Customer_ID,Full_Name,Age,Gender,Email_Address,Phone_Number,Account_Type,Account_Open_Date,Credit_Score,Income_Level
9256,CUST18559,Steven Castro,42.0,Female,tanderson@hotmail.com,561-577-0265,Personal,2025-06-21,747.85,€97821
15266,CUST20349,Tamara Crane,NaN,Male,tanderson@hotmail.com,987.437.9388x1313,NaN,2025-06-14,NaN,$93719

In [19]:
def replace_special_char(df, column):
    df[column] = df[column].astype(str).str.replace(r'[^\d.]', '', regex=True)
    return df

replace_special_char(data1, 'Income_Level')
print('special characters removed from Income Level col')

special characters removed from Income Level col

In [20]:
data1.isna().sum()

Customer_ID             0
Full_Name               0
Age                  8609
Gender               4213
Email_Address         842
Phone_Number            0
Account_Type         3335
Account_Open_Date       0
Credit_Score         8566
Income_Level            0
dtype: int64

In [21]:
data1['Gender'].isna().sum()
data1['Email_Address'].isna().sum()
data1['Account_Type'].isna().sum()
data1['Credit_Score'].isna().sum()

8566

In [22]:
def fill_with_unknown(x):
    if pd.isna(x):
        return 'Unknown'
    else:
        return x

data1['Gender'] = data1['Gender'].apply(fill_with_unknown)
data1['Email_Address'] = data1['Email_Address'].apply(fill_with_unknown)
data1['Account_Type'] = data1['Account_Type'].apply(fill_with_unknown)

In [23]:
data1['Credit_Score'] = data1['Credit_Score'].fillna(0)

In [24]:
data1['Gender'].isna().sum()
data1['Email_Address'].isna().sum()
data1['Account_Type'].isna().sum()
data1['Credit_Score'].isna().sum()

0

In [25]:
data1['Age'].isna().sum()

8609

In [26]:
data1['Age'] = data1.groupby(['Gender', 'Account_Type'])['Age'].transform(lambda x: x.fillna(x.median()))

In [27]:
data1['Age'].isna().sum()

0

In [28]:
data1.Phone_Number.tail()

17295            440-232-5333
17296      (286)395-7396x0611
17297      980.907.8619x60786
17298    001-123-677-4390x716
17299     +1-920-206-8780x336
Name: Phone_Number, dtype: object

In [29]:
import re
def clean_phone(clean):
    clean = re.sub(r'\D', '', clean)
    
    if len(clean) == 10:
        return f'{clean[:3]} {clean[3:6]} {clean[6:]}'
    elif len(clean) == 11:
        return f'{clean[0]} {clean[1:4]} {clean[4:7]} {clean[7:]}'
    elif len(clean) < 10 or len(clean) > 11:
        return 'Unknown'
    else:
        clean
    
data1['Phone_Number'] = data1['Phone_Number'].apply(clean_phone)
print('Phone number cleaned')

Phone number cleaned

In [30]:
data1[['Phone_Number', 'Gender', 'Account_Type']].sample(10)

       Phone_Number   Gender Account_Type
12954       Unknown     Male     Personal
12169       Unknown     Male      Unknown
16936  402 464 5831  Unknown      Savings
1368        Unknown   Female     Personal
10658       Unknown  Unknown     Business
15586       Unknown  Unknown      Savings
2105        Unknown   Female      Savings
7508        Unknown     Male      Savings
529         Unknown   Female     Checking
7203        Unknown  Unknown      Savings

In [31]:
data1['Income_Level'] = pd.to_numeric(data1['Income_Level'])
data1['Income_Unknown'] = data1['Income_Level'].isna()
data1[data1['Income_Unknown'] == True].head(8)

,Customer_ID,Full_Name,Age,Gender,Email_Address,Phone_Number,Account_Type,Account_Open_Date,Credit_Score,Income_Level,Income_Unknown
13,CUST17931,Jason Contreras,46.0,Unknown,maria61@gmail.com,Unknown,Checking,2025-06-22,0.00,NaN,True
16,CUST15591,Casey Garcia,50.0,Female,elizabeth95@valencia.com,034 051 6676,Personal,2025-06-18,768.47,NaN,True
35,CUST15492,Kelly Lopez,50.0,Unknown,mwalker@yahoo.com,Unknown,Unknown,2025-06-09,510.74,NaN,True
51,CUST16761,Deborah Castro,37.0,Male,dominicking@hotmail.com,Unknown,Savings,2025-06-22,0.00,NaN,True
64,CUST21879,Michael Ponce,80.0,Non-Binary,matthew66@cabrera.biz,Unknown,Savings,2025-06-26,0.00,NaN,True
68,CUST19777,Christina Christian,46.0,Female,daniel65@gmail.com,802 450 6394,Business,2025-06-18,0.00,NaN,True
79,CUST24538,Jennifer Mccoy,53.0,Female,campbelljessica@dawson.info,Unknown,Checking,2025-06-18,0.00,NaN,True
81,CUST22431,Victoria Elliott,51.0,Unknown,Unknown,460 572 3450,Unknown,2025-06-08,0.00,NaN,True

In [32]:
## Convert to Date
data1['Account_Open_Date'] = pd.to_datetime(data1['Account_Open_Date'])

## Second Dataset

In [33]:
data2 = pd.read_csv('Dataset_B_Financial_Transactions_Messy.csv')
data2.head()

,Customer_ID,Transaction_ID,Transaction_Date,Transaction_Amount,Merchant_Name,Transaction_Type
0,CUST26964,TXN115359,2025-06-16,$987.19,Apple,Deposit
1,CUST19314,TXN133314,2025-06-18,269.23,NaN,Transfer
2,CUST23304,TXN129227,2025-06-09,€977.8,Walmart,Transfer
3,CUST18760,TXN126833,2025-06-12,668.71,Target,POS
4,CUST18399,TXN106774,2025-06-23,334.51,NaN,Online

In [34]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34500 entries, 0 to 34499
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Customer_ID          34500 non-null  object
 1   Transaction_ID       34500 non-null  object
 2   Transaction_Date     34500 non-null  object
 3   Transaction_Amount   34500 non-null  object
 4   Merchant_Name        28731 non-null  object
 5   Transaction_Type     34500 non-null  object
dtypes: object(6)
memory usage: 1.6+ MB

In [35]:
## columns, whitespaces, null/na, check each column data, check and remove duplicates where necessary, check for special characters, check for inconsistencies

In [36]:
data2.columns

Index(['Customer_ID ', 'Transaction_ID ', 'Transaction_Date ',
       'Transaction_Amount ', 'Merchant_Name ', 'Transaction_Type '],
      dtype='object')

In [37]:
def del_ytspaces():
    data2.columns = data2.columns.str.strip()

del_ytspaces()
print(data2.columns.tolist())

['Customer_ID', 'Transaction_ID', 'Transaction_Date', 'Transaction_Amount', 'Merchant_Name', 'Transaction_Type']

In [38]:
data2.columns

Index(['Customer_ID', 'Transaction_ID', 'Transaction_Date',
       'Transaction_Amount', 'Merchant_Name', 'Transaction_Type'],
      dtype='object')

In [39]:
data2.head()

,Customer_ID,Transaction_ID,Transaction_Date,Transaction_Amount,Merchant_Name,Transaction_Type
0,CUST26964,TXN115359,2025-06-16,$987.19,Apple,Deposit
1,CUST19314,TXN133314,2025-06-18,269.23,NaN,Transfer
2,CUST23304,TXN129227,2025-06-09,€977.8,Walmart,Transfer
3,CUST18760,TXN126833,2025-06-12,668.71,Target,POS
4,CUST18399,TXN106774,2025-06-23,334.51,NaN,Online

In [40]:
data2.iloc[6,5]

'POS '

In [41]:
### strip Merchant_Name, Transaction_Type

In [42]:
def remove_ytspaces(df, column):
    df[column] = df[column].str.strip()
    return df
    
remove_ytspaces(data2, 'Customer_ID')
remove_ytspaces(data2, 'Transaction_ID')
remove_ytspaces(data2, 'Transaction_Date')
remove_ytspaces(data2, 'Transaction_Amount')
remove_ytspaces(data2, 'Merchant_Name')
remove_ytspaces(data2, 'Transaction_Type')

print('Whitespaces Removed')

Whitespaces Removed

In [43]:
data2.iloc[6,5]

'POS'

In [44]:
data2.isna().sum()

Customer_ID              0
Transaction_ID           0
Transaction_Date         0
Transaction_Amount       0
Merchant_Name         5769
Transaction_Type         0
dtype: int64

In [45]:
data2['Merchant_Name'].unique()

array(['Apple', nan, 'Walmart', 'Target', 'Amazon', 'Netflix'],
      dtype=object)

In [46]:
def replace_nan(x):
    if pd.isna(x):
        return 'Unknown'
    else:
        return x

data2['Merchant_Name'] = data2['Merchant_Name'].apply(replace_nan)

In [47]:
data2['Merchant_Name'].unique()

array(['Apple', 'Unknown', 'Walmart', 'Target', 'Amazon', 'Netflix'],
      dtype=object)

In [48]:
def remove_special_charc(df, column):
    df[column] = df[column].astype(str).str.replace(r'[^\d.]', '', regex=True)
    return df

remove_special_charc(data2, 'Transaction_Amount')
print('Special Characters removed from Transaction Amount col')

Special Characters removed from Transaction Amount col

In [49]:
## check for duplicates

In [50]:
data2['Customer_ID'].duplicated().sum()
data2['Transaction_ID'].duplicated().sum()

500

In [51]:
## Transaction Id has duplicates across rows
data2[data2['Transaction_ID'] == 'TXN123954']

,Customer_ID,Transaction_ID,Transaction_Date,Transaction_Amount,Merchant_Name,Transaction_Type
512,CUST22922,TXN123954,2025-06-19,658.62,Walmart,POS
34264,CUST22922,TXN123954,2025-06-19,658.62,Walmart,POS

In [52]:
## Customer with same ID carried out tranx on diff dates, amount, merchant and transaction type. We cannot remove duplicates for Customer ID

data2[data2['Customer_ID'] == 'CUST10269']

,Customer_ID,Transaction_ID,Transaction_Date,Transaction_Amount,Merchant_Name,Transaction_Type
8163,CUST10269,TXN110199,2025-06-28,467.65,Netflix,Withdrawal
8548,CUST10269,TXN129349,2025-06-14,681.31,Target,Transfer
14727,CUST10269,TXN113982,2025-06-26,775.01,Apple,POS
33842,CUST10269,TXN124024,2025-06-28,162.75,Unknown,Transfer
34498,CUST10269,TXN115942,2025-06-16,90.07,Target,Online

In [53]:
data2 = data2.drop_duplicates(subset='Transaction_ID', keep='first')

In [54]:
data2['Transaction_ID'].duplicated().sum()

0

In [55]:
data2.isna().sum()

Customer_ID           0
Transaction_ID        0
Transaction_Date      0
Transaction_Amount    0
Merchant_Name         0
Transaction_Type      0
dtype: int64

In [56]:
data2['Transaction_Date'] = pd.to_datetime(data2['Transaction_Date'], errors='coerce')

## Merge Both Data

In [57]:
df = pd.merge(data2, data1, on='Customer_ID', how='left')

In [58]:
df

,Customer_ID,Transaction_ID,Transaction_Date,Transaction_Amount,Merchant_Name,Transaction_Type,Full_Name,Age,Gender,Email_Address,Phone_Number,Account_Type,Account_Open_Date,Credit_Score,Income_Level,Income_Unknown
0,CUST26964,TXN115359,2025-06-16,987.19,Apple,Deposit,Shannon Taylor,50.0,Non-Binary,kimberlywhite@hotmail.com,Unknown,Savings,2025-06-21,0.00,88938.0,False
1,CUST19314,TXN133314,2025-06-18,269.23,Unknown,Transfer,Andrew Diaz,33.0,Non-Binary,kennedybrandon@gmail.com,Unknown,Unknown,2025-06-15,577.83,59798.0,False
2,CUST23304,TXN129227,2025-06-09,977.8,Walmart,Transfer,Joyce Morgan,51.0,Unknown,michelle54@yahoo.com,Unknown,Unknown,2025-06-20,345.08,78264.0,False
3,CUST18760,TXN126833,2025-06-12,668.71,Target,POS,Amanda Campbell,49.0,Male,stephensfrank@hotmail.com,Unknown,Personal,2025-06-18,837.20,121625.0,False
4,CUST18399,TXN106774,2025-06-23,334.51,Unknown,Online,Alexis Gray,49.0,Male,amy04@hotmail.com,Unknown,Personal,2025-06-17,0.00,132211.0,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
33995,CUST16274,TXN121566,2025-06-09,105.55,Target,Online,Mark Cruz,48.0,Unknown,jacob34@hotmail.com,Unknown,Checking,2025-06-25,606.77,144014.0,False
33996,CUST26747,TXN128235,2025-06-12,600.3,Target,Online,Laura King,28.0,Male,pbarrett@yahoo.com,Unknown,Unknown,2025-06-08,392.64,NaN,True
33997,CUST24880,TXN126281,2025-06-15,873.46,Netflix,POS,Tammie Castillo,51.0,Female,bgonzalez@smith-russo.com,Unknown,Unknown,2025-06-13,0.00,96779.0,False
33998,CUST10269,TXN115942,2025-06-16,90.07,Target,Online,Brian Warren,46.0,Unknown,montgomeryalbert@king.org,Unknown,Checking,2025-06-22,0.00,94130.0,False
33999,CUST14132,TXN119757,2025-06-14,659.85,Walmart,Online,Calvin Coleman,64.0,Unknown,hickskimberly@gmail.com,Unknown,Unknown,2025-06-20,718.05,67597.0,False

In [59]:
df.isna().sum()

Customer_ID              0
Transaction_ID           0
Transaction_Date         0
Transaction_Amount       0
Merchant_Name            0
Transaction_Type         0
Full_Name                0
Age                      0
Gender                   0
Email_Address            0
Phone_Number             0
Account_Type             0
Account_Open_Date        0
Credit_Score             0
Income_Level          3471
Income_Unknown           0
dtype: int64

In [61]:
df.to_excel('Cleaned_Financial_Record.xlsx', index=False)